# vim: set ft=ruby

# Taps
tap 'hashicorp/tap'
tap 'nikitabobko/tap'
tap 'siderolabs/tap'
tap 'fluxcd/tap'

# Core utilities
brew 'age'
brew 'aider'
brew 'atuin'
brew 'awscli'
brew 'bat'
brew 'btop'
brew 'direnv'
brew 'eza'
brew 'ffmpeg'
brew 'fzf'
brew 'gnupg'
brew 'jq'
brew 'mtr'
brew 'neofetch'
brew 'nvm'
brew 'pgcli'
brew 'prettier'
brew 'restic'
brew 'ripgrep'
brew 'sops'
brew 'syncthing'
brew 'tmux'
brew 'uv'
brew 'watch'
brew 'wget'
brew 'yq'
brew 'yt-dlp'
brew 'zoxide'
brew 'hashicorp/tap/terraform'
brew 'siderolabs/tap/talosctl'

# Golang tools
brew 'go'
brew 'delve'
brew 'gopls'
brew 'gotests'
brew 'graphviz'

# Editor and language servers
brew 'neovim'
brew 'marksman'
brew 'lazygit'
brew 'typescript-language-server'
brew 'yaml-language-server'

# Kubernetes
brew 'chart-testing'
brew 'helm'
brew 'kind'
brew 'kubecolor'
brew 'kubectx'
brew 'kustomize'
brew 'stern'
brew 'yamllint'
brew 'fluxcd/tap/flux'

# cask 'istat-menus'
cask 'audacity'
cask 'brave-browser'
cask 'chatgpt'
cask 'firefox'
cask 'font-jetbrains-mono'
cask 'ghostty'
cask 'google-cloud-sdk'
cask 'nikitabobko/tap/aerospace'
cask 'orbstack'
cask 'raycast'
cask 'telegram'
cask 'visual-studio-code'
cask 'vlc'
