# vim: set ft=ruby

brew 'atuin'
brew 'awscli'
brew 'btop'
brew 'direnv'
brew 'eza'
brew 'ffmpeg'
brew 'fzf'
brew 'go'
brew 'jq'
brew 'mtr'
brew 'neofetch'
brew 'node'
brew 'pgcli'
brew 'pgrep'
brew 'pkill'
brew 'prettier'
brew 'restic'
brew 'ripgrep'
brew 'sops'
brew 'stern'
brew 'tmux'
brew 'uv'
brew 'watch'
brew 'yq'
brew 'yt-dlp'
brew 'zoxide'

tap 'hashicorp/tap'
brew 'hashicorp/tap/terraform'

# neovim
brew 'neovim'
brew 'marksman'
brew 'lazygit'
brew 'typescript-language-server'

# Kubernetes
brew 'chart-testing'
brew 'yamllint'
brew 'stern'
brew 'kubernetes-cli'
brew 'kubecolor'
brew 'kustomize'
brew 'helm'
brew 'kubectx'
tap "fluxcd/tap"
brew "fluxcd/tap/flux"

# cask 'istat-menus'
cask 'google-cloud-sdk'
cask 'font-jetbrains-mono'
cask 'ghostty'
cask 'nikitabobko/tap/aerospace'
cask 'orbstack'
cask 'raycast'
cask 'visual-studio-code'
cask 'vlc'
